Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
	uint32_t now = DWT->CYCCNT;
	uint32_t elapsed = now - _last_stats_print_cycle;
	_last_stats_print_cycle = now;

	uint32_t now_tick = _sys_tick_ms;
	uint32_t elapsed_ms = now_tick - _last_stats_tick;
	_last_stats_tick = now_tick;

	// Fill stat snapshots with data
	for (int i = 0; i < SCHEDULER_MAX_TASKS; i++) {
		if (i == SCHEDULER_IDLE_TASK_INDEX) continue;
		if (_tasks[i].state != TaskDeleted && _tasks[i].function) {
			_Task_Stats_TypeDef *s = &_task_stats[i];
			snap[snap_n].cycles = s->total_cycles;
			snap[snap_n].min_cycles = (s->min_cycles == 0xFFFFFFFF) ? 0 : s->min_cycles;
			snap[snap_n].max_cycles = s->max_cycles;
			snap[snap_n].preempts = s->total_preempts;
			snap[snap_n].invocs = s->total_invocations;
			snap[snap_n].name = _tasks[i].pcName ? _tasks[i].pcName : "?";
			total += s->total_cycles;
			s->total_cycles = 0;
			s->total_preempts = 0;
			s->total_invocations = 0;
			s->min_cycles = 0xFFFFFFFF;
			s->max_cycles = 0;
			s->last_start_cycle = now;
			snap_n++;
		}
	}

	uint32_t isr_snapshot = _isr_total_cycles;
	_isr_total_cycles = 0;
	uint32_t idle = (elapsed > (total + isr_snapshot)) ? (elapsed - total - isr_snapshot) : 0;
	__enable_irq();

	if (elapsed == 0) {
		return;
	}

	DEBUG_PRINTF("\r\n");
	DEBUG_PRINTF("%-14.14s %-10s %-10s %-10s %-10s %-7s %-9s %-8s\r\n",
		"Name", "cycle", "min", "max", "avg", "%ACT", "Prempt", "Invoc");
	DEBUG_PRINTF("---------------------------------------------------------------------------------------\r\n");

	for (int i = 0; i < snap_n; i++) {
		uint32_t avg = snap[i].invocs ? (snap[i].cycles / snap[i].invocs) : 0;
		DEBUG_PRINTF("%-14.14s %10lu %10lu %10lu %10lu %6.2f%% %9lu %8lu\r\n",
			snap[i].name,
			snap[i].cycles,
			snap[i].min_cycles,
			snap[i].max_cycles,
			avg,
			(float)snap[i].cycles * 100.0f / (float)elapsed,
			snap[i].preempts,
			snap[i].invocs);
	}

	DEBUG_PRINTF("%-14.14s %10s %10s %10s %10s %6.2f%% %9s %8s\r\n",
		"Idle", "0", "0", "0", "0",
		(float)idle * 100.0f / (float)elapsed, "0", "0");

	DEBUG_PRINTF("%-14.14s %10lu %10s %10s %10s %6.2f%% %9s %8s\r\n",
		"ISR", isr_snapshot, "-", "-", "-",
		(float)isr_snapshot * 100.0f / (float)elapsed, "-", "-");

	float cpu_util = (float)(total + isr_snapshot) * 100.0f / (float)elapsed;
	float wake_rate = (float)_idle_wakeups / (float)elapsed_ms;
	DEBUG_PRINTF("\r\nCPU Util: %6.2f%% (wall %lu ms, active %lu cyc, %lu WFI/s)\r\n",
		cpu_util, elapsed_ms, elapsed, (uint32_t)(wake_rate * 1000.0f));
	DEBUG_PRINTF("=======================================================================================\r\n");
}

/**
 * @brief TIM7 interrupt handler - scheduler tick
 *
 * Increments the system tick counter and marks tasks ready when
 * their period has elapsed, then pends PendSV for context switch.
 */
void TIM7_IRQHandler(void){
	SCHEDULER_ISR_enter();

	uint32_t tim_flag;
	TIMER_GetFlag(TIM7, TIM_SR_UIF, &tim_flag);
	if (tim_flag) {
		TIMER_ClearFlag(TIM7, TIM_SR_UIF);

		_sys_tick_ms++;

		// Check which Tasks cycle time has expired
		for (int i = 0; i < SCHEDULER_IDLE_TASK_INDEX; i++) {
			if (_tasks[i].state != TaskDeleted && _tasks[i].state != TaskSuspended && _tasks[i].function != 0) {
				if ((_sys_tick_ms - _tasks[i].last_run_ms)
					>= _tasks[i].period_ms) {
					_tasks[i].last_run_ms = _sys_tick_ms;

					if (_tasks[i].state == TaskBlocked) {
						SCHEDULER_InitTaskStack(i);
					}

					_tasks[i].state = TaskReady;
				}
			}
		}

		SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;

		// Look for stats to be printed
		if (_scheduler_running
			&& (_sys_tick_ms - _last_print_tick >= 1000)) {
			_last_print_tick = _sys_tick_ms;
			_stats_pending = 1;
		}
	}
	SCHEDULER_ISR_exit();
}

// -------------------------------------------------------------------------
// Public API
// -------------------------------------------------------------------------

SCHEDULER_Status_TypeDef SCHEDULER_Task_add(
	SCHEDULER_Task_Function_TypeDef pvTaskCode,
	const char* pcName,
	uint32_t period_ms,
	uint8_t priority,
	uint8_t* taskIndex){

	if (taskIndex == NULL)  { return SCHEDULER_ERR_NOT_FOUND;  }
	if (pvTaskCode == NULL) { return SCHEDULER_ERR_TASK_INVALID; }

	int slot = -1;
	for (int i = 0; i < SCHEDULER_IDLE_TASK_INDEX; i++) {
		if (_tasks[i].state == TaskDeleted) {
			slot = i;
			break;
		}
	}

	if (slot < 0) { return SCHEDULER_ERR_FULL; }

	_tasks[slot].function	    = pvTaskCode;
	_tasks[slot].period_ms	    = period_ms;
	_tasks[slot].last_run_ms    = _sys_tick_ms;
	_tasks[slot].priority	    = priority;
	_tasks[slot].stack_overflow = 0;
	_tasks[slot].pcName         = pcName;

	SCHEDULER_InitTaskStack(slot);

	_tasks[slot].state		    = TaskReady;

	*taskIndex = (uint8_t)slot;

	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_Task_remove(int taskIndex){
	if (taskIndex < 0 || taskIndex >= SCHEDULER_IDLE_TASK_INDEX) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	_tasks[taskIndex].state      = TaskDeleted;
	_tasks[taskIndex].function   = 0;
	_tasks[taskIndex].pcName     = 0;

	return SCHEDULER_OK;
}

void SCHEDULER_System_init(void){
	TIMER_Config(TIM7, 400, 999, 0);
	TIMER_EnableIT(TIM7);

	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
	uint32_t cnt = DWT->CYCCNT;
	_last_stats_print_cycle = cnt;
	_last_stats_tick = 0;
	for (int i = 0; i < SCHEDULER_MAX_TASKS; i++) {
		_task_stats[i].last_start_cycle = cnt;
		_task_stats[i].min_cycles = 0xFFFFFFFF;
		_task_stats[i].max_cycles = 0;
	}
}

SCHEDULER_Status_TypeDef SCHEDULER_Tick_get(uint32_t* tick){
	if (tick == 0) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	*tick = _sys_tick_ms;
	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_Task_suspend(uint8_t taskIndex){
	if (taskIndex >= SCHEDULER_IDLE_TASK_INDEX) {
		return SCHEDULER_ERR_NOT_FOUND;
	}
	if (_tasks[taskIndex].state == TaskDeleted) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	__disable_irq();
	_tasks[taskIndex].state = TaskSuspended;
	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
	__enable_irq();

	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_Task_resume(uint8_t taskIndex){
	if (taskIndex >= SCHEDULER_IDLE_TASK_INDEX) {
		return SCHEDULER_ERR_NOT_FOUND;
	}
	if (_tasks[taskIndex].state != TaskSuspended) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	__disable_irq();
	_tasks[taskIndex].state = TaskReady;
	_tasks[taskIndex].last_run_ms = _sys_tick_ms;
	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
	__enable_irq();

